Revit 2027 API
AnalyticalElement.StructuralRole Property
 The enum value depicting structural role asigned to the Analytical Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalyticalStructuralRole StructuralRole { get; set; }
Public Property StructuralRole As AnalyticalStructuralRole
	Get
	Set
public:
property AnalyticalStructuralRole StructuralRole {
	AnalyticalStructuralRole get ();
	void set (AnalyticalStructuralRole value);
}
member StructuralRole : AnalyticalStructuralRole with get, set
Property Value
AnalyticalStructuralRole
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The provided AnalyticalStructuralRole is not supported
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace